FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Access Hooks                       */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface )
{
    ( void ) pxInterface;

    BaseType_t xReturn = pdFALSE;

    /* const BaseType_t xEMACIndex = *( ( BaseType_t * ) pxInterface->pvArgument ); */

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdTRUE;
    }

    return xReturn;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xInitResult = pdFAIL;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    switch( xMacInitStatus )
    {
        default:
            configASSERT( pdFALSE );
            break;

        case eMacEthInit:
            if( prvEthConfigInit( pxEthHandle, pxInterface ) == pdFALSE )
            {
                break;
            }

            xMacInitStatus = eMacPhyInit;
            /* fallthrough */

        case eMacPhyInit:
            vPhyInitialise( pxPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

            if( xPhyDiscover( pxPhyObject ) == 0 )
            {
                break;
            }

            xMacInitStatus = eMacPhyStart;
            /* fallthrough */

        case eMacPhyStart:
            if( prvPhyStart( pxEthHandle, pxInterface, pxPhyObject ) == pdFALSE )
            {
                break;
            }

            xMacInitStatus = eMacTaskStart;
            /* fallthrough */

        case eMacTaskStart:
            if( prvEMACTaskStart( pxInterface ) == pdFALSE )
            {
                break;
            }

            xMacInitStatus = eMacEthStart;
            /* fallthrough */

        case eMacEthStart:
            if( pxEthHandle->gState != HAL_ETH_STATE_STARTED )
            {
                if( HAL_ETH_Start_IT( pxEthHandle ) != HAL_OK )
                {
                    break;
                }
            }

            xMacInitStatus = eMacInitComplete;
            /* fallthrough */

        case eMacInitComplete:
            if( prvGetPhyLinkStatus( pxInterface ) == pdTRUE )
            {
                xInitResult = pdPASS;
            }
    }

    return xInitResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface, NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t xReleaseAfterSend )
{
    BaseType_t xResult = pdFAIL;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    /* Zero-Copy Only */
    configASSERT( xReleaseAfterSend == pdTRUE );

    do
    {
        if( ( pxDescriptor == NULL ) || ( pxDescriptor->pucEthernetBuffer == NULL ) || ( pxDescriptor->xDataLength > niEMAC_DATA_BUFFER_SIZE ) )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Invalid Descriptor\n" ) );
            break;
        }

        if( xCheckLoopback( pxDescriptor, xReleaseAfterSend ) != pdFALSE )
        {
            /* The packet has been sent back to the IP-task.
             * The IP-task will further handle it.
             * Do not release the descriptor. */
            xReleaseAfterSend = pdFALSE;
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Loopback\n" ) );
            break;
        }

        if( ( xMacInitStatus != eMacInitComplete ) || ( pxEthHandle->gState != HAL_ETH_STATE_STARTED ) )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Interface Not Started\n" ) );
            break;
        }

        if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Link Down\n" ) );
            break;
        }

        if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Process Busy\n" ) );
            /* TODO: Can we queue it? */
            break;
        }

        static ETH_TxPacketConfig xTxConfig = {
            .CRCPadCtrl = ETH_CRC_PAD_INSERT,
            #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
                .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD | ETH_TX_PACKETS_FEATURES_CSUM,
                .ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC,
            #else
                .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD,
                .ChecksumCtrl = ETH_CHECKSUM_DISABLE,
            #endif
        };

        xTxConfig.pData = pxDescriptor;
        #if ipconfigIS_DISABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            ETH_BufferTypeDef xTxBuffer = {
                .buffer = ( uint8_t * ) pxDescriptor->pucEthernetBuffer,
                .len = pxDescriptor->xDataLength,
                .next = NULL
            };

            xTxConfig.TxBuffer = &xTxBuffer;
            xTxConfig.Length = xTxBuffer.len;

            /*#if defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U )
                if( niEMAC_CACHE_ENABLED )
                {
                    uint8_t * pucDataStart = xTxBuffer.buffer;
                    uint8_t * pucLineStart = ( uint8_t * ) ( ( uint32_t ) pucDataStart & ~niEMAC_ALIGNMENT_MASK );
                    SCB_CleanDCache_by_Addr( ( uint32_t * ) pucLineStart, xTxBuffer.len + ( pucDataStart - pucLineStart ) );
                }
            #endif*/
        #else
            /* Support the possibility of linked Tx messages */
            ETH_BufferTypeDef xTxBuffer[ niEMAC_MAX_LINKED_TX_PACKETS ];

            xTxConfig.TxBuffer = xTxBuffer;
            xTxConfig.Length = 0;
            UBaseType_t uxIndex = 0;
            NetworkBufferDescriptor_t * pxCurDescriptor = pxDescriptor;
            while( pxCurDescriptor != NULL )
            {
                ETH_BufferTypeDef * pxCurTxBuffer = &xTxBuffer[ uxIndex++ ];
                pxCurTxBuffer->buffer = ( uint8_t * ) pxCurDescriptor->pucEthernetBuffer;
                pxCurTxBuffer->len = pxCurDescriptor->xDataLength;
                pxCurTxBuffer->next = ( uxIndex < ARRAY_SIZE( xTxBuffer ) ) ? &xTxBuffer[ uxIndex ] : NULL;
                xTxConfig.Length += pxCurTxBuffer->len;
                /*#if defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U )
                    if( niEMAC_CACHE_ENABLED )
                    {
                        uint8_t * pucDataStart = pxCurTxBuffer->buffer;
                        uint8_t * pucLineStart = ( uint8_t * ) ( ( uint32_t ) pucDataStart & ~niEMAC_ALIGNMENT_MASK );
                        SCB_CleanDCache_by_Addr( ( uint32_t * ) pucLineStart, pxCurTxBuffer->len + ( pucDataStart - pucLineStart ) );
                    }
                #endif*/
                pxCurDescriptor = pxCurDescriptor->pxNextBuffer;
            };
        #endif

        if( HAL_ETH_Transmit_IT( pxEthHandle, &xTxConfig ) == HAL_OK )
        {
            /* Released later in deferred task by calling HAL_ETH_ReleaseTxPacket */
            xReleaseAfterSend = pdFALSE;
            xResult = pdPASS;
        }
        else
        {
            configASSERT( ( pxEthHandle->ErrorCode & HAL_ETH_ERROR_PARAM ) == 0 );
            configASSERT( pxEthHandle->gState == HAL_ETH_STATE_STARTED );
            if( pxEthHandle->ErrorCode & HAL_ETH_ERROR_BUSY )
            {
                FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Tx Busy\n" ) );
            }
        }
        ( void ) xSemaphoreGive( xTxMutex );

    } while( pdFALSE );

    if( xReleaseAfterSend == pdTRUE )
    {
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }

    return xResult;
}

