FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvAddAllowedMACAddress( const uint8_t * pucMacAddress )
{
    configASSERT( pucMacAddress );

    BaseType_t xFound = pdFALSE;
    for( UBaseType_t uxIndex = 0; uxIndex < ARRAY_SIZE( xMatchedMacAddresses ); ++uxIndex )
    {
        /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
        if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
        {
            /* Already assigned this mac address */
            xFound = pdTRUE;
        }
    }

    if( xFound == pdFALSE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        ETH_MACFilterConfigTypeDef xFilterConfig;

        switch( uxMACEntry )
        {
            case ETH_MAC_ADDRESS1:
                ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, ( uint8_t * ) pucMacAddress );
                ( void ) memcpy( xMatchedMacAddresses[ 0 ].ucBytes, pucMacAddress, ipMAC_ADDRESS_LENGTH_BYTES );
                uxMACEntry = ETH_MAC_ADDRESS2;
                /* Only need to do this once, don't repeat for following addresses */
                ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );
                if( xFilterConfig.HachOrPerfectFilter == DISABLE )
                {
                    xFilterConfig.HachOrPerfectFilter = ENABLE;
                    ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
                }
                break;

            case ETH_MAC_ADDRESS2:
                ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, ( uint8_t * ) pucMacAddress );
                ( void ) memcpy( xMatchedMacAddresses[ 1 ].ucBytes, pucMacAddress, ipMAC_ADDRESS_LENGTH_BYTES );
                uxMACEntry = ETH_MAC_ADDRESS3;
                break;

            case ETH_MAC_ADDRESS3:
                ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, ( uint8_t * ) pucMacAddress );
                ( void ) memcpy( xMatchedMacAddresses[ 2 ].ucBytes, pucMacAddress, ipMAC_ADDRESS_LENGTH_BYTES );
                /* Just used to show that the address registers are filled */
                uxMACEntry = ETH_MAC_ADDRESS0;
                break;

            case ETH_MAC_ADDRESS0:
                prvUpdateMacHashFilter( pxEthHandle, pucMacAddress );
                ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );
                if( niEMAC_MAC_IS_MULTICAST( pucMacAddress ) == pdTRUE )
                {
                    if( xFilterConfig.HashMulticast == DISABLE )
                    {
                        xFilterConfig.HashMulticast = ENABLE;
                        ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
                    }
                }
                else
                {
                    if( xFilterConfig.HashUnicast == DISABLE )
                    {
                        xFilterConfig.HashUnicast = ENABLE;
                        ( void ) HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig );
                    }
                }
                break;

            default:
                configASSERT( pdFALSE );
                break;
        }
    }
}

/*---------------------------------------------------------------------------*/

#if 0

static void prvRemoveAllowedMACAddress( const uint8_t * pucMacAddress )
{
    configASSERT( pucMacAddress );

    /* const BaseType_t xIsMulticast = niEMAC_MAC_IS_MULTICAST( pucMacAddress ); */

    BaseType_t xFound = pdFALSE;
    for( UBaseType_t uxIndex = 0; uxIndex < ARRAY_SIZE( xMatchedMacAddresses ); ++uxIndex )
    {
        /* Temporary inefficient method to avoid writing a HAL_ETH_GetSourceMACAddrMatch for Hx & Fx */
        if( memcmp( pucMacAddress, xMatchedMacAddresses[ uxIndex ].ucBytes, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
        {
            /* Already assigned this mac address */
            xFound = pdTRUE;
        }
    }

    if( xFound == pdTRUE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        ETH_MACFilterConfigTypeDef xFilterConfig;
        ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );

    }
}

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;
    /* if( ( xMacInitStatus == eMacInitComplete ) && ( heth->gState == HAL_ETH_STATE_STARTED ) ) */
    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
    {
        ++uxCount;
        if( pxCurDescriptor == NULL )
        {
            /* Buffer was dropped, ignore packet */
            continue;
        }
        configASSERT( pxEthHandle->RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE );

        pxCurDescriptor->pxInterface = pxInterface;
        pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            if( pxStartDescriptor == NULL )
            {
                pxStartDescriptor = pxCurDescriptor;
            }
            else if( pxEndDescriptor != NULL )
            {
                pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
            }
            pxEndDescriptor = pxCurDescriptor;
        #else
            prvSendRxEvent( pxCurDescriptor );
        #endif
    }

