FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                             EMAC Helpers                                  */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle, EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    ETH_MACConfigTypeDef xMACConfig;
    ( void ) HAL_ETH_GetMACConfig( pxEthHandle , &xMACConfig );
    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    #else
        pxPhyObject->xPhyPreferences.ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10;
        pxPhyObject->xPhyPreferences.ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF;
        /* ucMDI_X unused */
        /* TODO: xPhyFixedValue always return 0 */
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = pxPhyObject->xPhyPreferences.ucDuplex;
        xMACConfig.Speed = pxPhyObject->xPhyPreferences.ucSpeed;
    #endif

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) == HAL_OK )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvCalcCrc32( const uint8_t * pucMAC )
{
    uint32_t ulCRC32 = 0xFFFFFFFF;

    for( uint8_t ucIndex = ipMAC_ADDRESS_LENGTH_BYTES; ucIndex > 0; --ucIndex )
    {
        ulCRC32 ^= ( uint32_t ) pucMAC[ ucIndex ];

        for( uint8_t ucJndex = 0; ucJndex < 8; ++ucJndex )
        {
            const BaseType_t xTemp = ulCRC32 & 1;
            ulCRC32 >>= 1;
            if( xTemp )
            {
                ulCRC32 ^= __RBIT( niEMAC_CRC_POLY );
            }
        }
    }

    /* Perform bitwise reversal on the CRC32 */
    return __RBIT( ~ulCRC32 );
}

/*---------------------------------------------------------------------------*/

/* Update the Hash Table Registers with hash value of the given MAC address */
static void prvUpdateMacHashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[ 2 ];

    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulHash = prvCalcCrc32( pucMAC );

    /* Take the upper 6 bits of the above result */
    const uint8_t ucEntry = ( ulHash >> 26 ) & 0x3F;

    /* Use the upper or lower Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ucEntry < 32 )
    {
        ulHashTable[ 0 ] |= ( 1 << ucEntry );
    }
    else
    {
        ulHashTable[ 1 ] |= ( 1 << ( ucEntry % 32 ) );
    }

    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;
    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    };
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent = {
        .eEventType = eNetworkRxEvent,
        .pvData = ( void * ) pxDescriptor
    };
    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Filter Helpers                                  */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#ifdef niEMAC_STM32HX

static void prvInitPacketFilter( ETH_HandleTypeDef * pxEthHandle, const NetworkInterface_t * const pxInterface )
{
    HAL_ETHEx_DisableL3L4Filtering( pxEthHandle );

    const uint32_t uxL3FilterIds[ 2 ] = { ETH_L3_FILTER_0, ETH_L3_FILTER_1 };
    uint32_t uxL3FilterIdIndex = 0;

    for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        ETH_L3FilterConfigTypeDef xL3FilterConfig;
        /* #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) ) */
        if( ENDPOINT_IS_IPv4( pxEndPoint ) )
        {
            ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex ], &xL3FilterConfig );
            xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
            ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex++ ], &xL3FilterConfig );
        }
        /* #if ( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) ) */
        else if( ENDPOINT_IS_IPv6( pxEndPoint ) )
        {
            ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex ], &xL3FilterConfig );
            xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
            ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, uxL3FilterIds[ uxL3FilterIdIndex++ ], &xL3FilterConfig );
        }

        if( uxL3FilterIdIndex >= ARRAY_SIZE( uxL3FilterIds ) )
        {
            break;
        }
    }

    /* TODO: This needs to be live updated based on sockets? */
    /* ETH_L4FilterConfigTypeDef xL4FilterConfigUDP;
    ( void ) HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfigUDP );
    xL4FilterConfigUDP.Protocol = ETH_L4_UDP_MATCH;
    ( void ) HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfigUDP );

