FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            MII Specific Pins
            ETH_RX_CLK ------------------->
            ETH_RX_ER -------------------->
            ETH_RX_DV -------------------->
            ETH_RXD2 --------------------->
            ETH_RXD3 --------------------->
            ETH_TX_CLK ------------------->
            ETH_TXD2 --------------------->
            ETH_TXD3 --------------------->
            ETH_CRS ---------------------->
            ETH_COL ---------------------->
        */

        GPIO_InitTypeDef GPIO_InitStructure = { 0 };
        GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Pull = GPIO_NOPULL;
        GPIO_InitStructure.Alternate = GPIO_AF11_ETH;

        GPIO_InitStructure.Pin = ETH_MDC_Pin;
        GPIO_InitStructure.Speed = GPIO_SPEED_MEDIUM;
        HAL_GPIO_Init(ETH_MDC_Port, &GPIO_InitStructure);
        GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;

        GPIO_InitStructure.Pin = ETH_MDIO_Pin;
        HAL_GPIO_Init(ETH_MDIO_Port, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = ETH_RXD0_Pin;
        HAL_GPIO_Init(ETH_RXD0_Port, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = ETH_RXD1_Pin;
        HAL_GPIO_Init(ETH_RXD1_Port, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = ETH_TX_EN_Pin;
        HAL_GPIO_Init(ETH_TX_EN_Port, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = ETH_TXD0_Pin;
        HAL_GPIO_Init(ETH_TXD0_Port, &GPIO_InitStructure);

        GPIO_InitStructure.Pin = ETH_TXD1_Pin;
        HAL_GPIO_Init(ETH_TXD1_Port, &GPIO_InitStructure);

        if( heth->Init.MediaInterface == HAL_ETH_RMII_MODE )
        {
            GPIO_InitStructure.Pin = ETH_REF_CLK_Pin;
            HAL_GPIO_Init(ETH_REF_CLK_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_CRS_DV_Pin;
            HAL_GPIO_Init(ETH_CRS_DV_Port, &GPIO_InitStructure);
        }
        else if( heth->Init.MediaInterface == HAL_ETH_MII_MODE )
        {
            GPIO_InitStructure.Pin = ETH_RX_CLK_Pin;
            HAL_GPIO_Init(ETH_RX_CLK_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_RX_ER_Pin;
            HAL_GPIO_Init(ETH_RX_ER_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_RX_DV_Pin;
            HAL_GPIO_Init(ETH_RX_DV_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_RXD2_Pin;
            HAL_GPIO_Init(ETH_RXD2_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_RXD3_Pin;
            HAL_GPIO_Init(ETH_RXD3_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_TX_CLK_Pin;
            HAL_GPIO_Init(ETH_TX_CLK_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_TXD2_Pin;
            HAL_GPIO_Init(ETH_TXD2_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_TXD3_Pin;
            HAL_GPIO_Init(ETH_TXD3_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_COL_Pin;
            HAL_GPIO_Init(ETH_COL_Port, &GPIO_InitStructure);

            GPIO_InitStructure.Pin = ETH_CRS_Pin;
            HAL_GPIO_Init(ETH_CRS_Port, &GPIO_InitStructure);
        }

        /* Enable the Ethernet global Interrupt */
        HAL_NVIC_SetPriority( ETH_IRQn, ( uint32_t ) configMAX_FREERTOS_INTERRUPT_PRIORITY, 0 );
        HAL_NVIC_EnableIRQ( ETH_IRQn );
    }
}

#endif /* if 0 */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            Sample MPU Config                              */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if 0

void MPU_Config(void)
{
    /* #if defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U ) */
    /* TODO: Usage based on if niEMAC_CACHE_ENABLED */

    extern uint8_t __ETH_BUFFERS_START, __ETH_DESCRIPTORS_START;

    MPU_Region_InitTypeDef MPU_InitStruct;

    HAL_MPU_Disable();

    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.BaseAddress = ( uint32_t ) &__ETH_BUFFERS_START;
    MPU_InitStruct.Size = MPU_REGION_SIZE_128KB;
    MPU_InitStruct.SubRegionDisable = 0x0;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

    HAL_MPU_ConfigRegion(&MPU_InitStruct);

    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    MPU_InitStruct.BaseAddress = ( uint32_t ) &__ETH_DESCRIPTORS_START;
    MPU_InitStruct.Size = MPU_REGION_SIZE_1KB;
    MPU_InitStruct.SubRegionDisable = 0x0;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

    HAL_MPU_ConfigRegion(&MPU_InitStruct);

    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

#endif /* if 0 */

/*---------------------------------------------------------------------------*/
